app/views/authors/show.html.erb

<h2>Books belonging to this author</h2>
<% @author.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 1]]