app/controllers/authors_controller.rb

  def create
   @author = Author.new(author_params)

  @author.save
---
INSERT INTO "authors" ("author", "created_at", "updated_at") VALUES (?, ?, ?)  [["author", "Lindsey Drew"], ["created_at", "2017-08-20 10:07:34.576933"], ["updated_at", "2017-08-20 10:07:34.576933"]]