app/controllers/books_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "books" ("name", "catagory", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "hshsdhs"], ["catagory", "sdhsdh"], ["author_id", 1], ["created_at", "2017-08-20 11:55:40.696169"], ["updated_at", "2017-08-20 11:55:40.696169"]]
---
	def create
    @author = Author.find(params[:author_id])
    @book = @author.books.create(book_params)